#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_instance_group.backend_ig will be created
  + resource "google_compute_instance_group" "backend_ig" {
      + description = "frontend_ig"
      + id          = (known after apply)
      + instances   = (known after apply)
      + name        = "backend_ig"
      + network     = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/global/networks/my-name"
      + project     = (known after apply)
      + self_link   = (known after apply)
      + size        = (known after apply)
      + zone        = "europe-north1-a"
    }

  # google_compute_instance_group.database_ig will be created
  + resource "google_compute_instance_group" "database_ig" {
      + description = "database_ig"
      + id          = (known after apply)
      + instances   = (known after apply)
      + name        = "database"
      + network     = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/global/networks/my-name"
      + project     = (known after apply)
      + self_link   = (known after apply)
      + size        = (known after apply)
      + zone        = "europe-north1-a"
    }

  # google_compute_instance_group.frontend_ig will be created
  + resource "google_compute_instance_group" "frontend_ig" {
      + description = "frontend_ig"
      + id          = (known after apply)
      + instances   = [
          + "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/zones/europe-north1-a/instances/vm0",
          + "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/zones/europe-north1-a/instances/vm1",
          + "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/zones/europe-north1-a/instances/vm2",
        ]
      + name        = "frontend_ig"
      + network     = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/global/networks/my-name"
      + project     = (known after apply)
      + self_link   = (known after apply)
      + size        = (known after apply)
      + zone        = "europe-north1-a"

      + named_port {
          + name = "http"
          + port = 8080
        }
      + named_port {
          + name = "https"
          + port = 8443
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Warning: Interpolation-only expressions are deprecated

  on main.tf line 60, in resource "google_compute_instance" "vm_instance":
  60:     network    = "${google_compute_network.vpc_network.self_link}"

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.

```

</details>

*Workflow: `Terraform GitHub Actions`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
